Repository: danielvhvs/NLP_Bsc_RUG
Catalog: en-hu1.tmx
Source language: en
Languages: hu

source: (To me, forever)
hu: ~Nekem, örökké~

source: I was made to hit in America (I was made to hit in America) I was made to hit in America
hu: Még pár év, és miénk Amerika

source: "C-Major Pentatonic Scale"
hu: Nem megy. Semmi nem volt még ilyen nehéz.

source: It's too hard for me.
hu: Ez lehetetlen.

source: But it's better to learn the scale early.
hu: Tudod, jobb minél előbb megtanulni a skálát.

source: You stupid bird!
hu: Idióta madár!

source: I'll show you!
hu: Akkor is énekelni fogsz!

source: Don't rush it, Koyuki-kun.
hu: Nem siettetheted, Koyuki-kun!

source: It's only been two months since you started playing the guitar.
hu: Alig több, mint két hónapja kezdtél gitározni.

source: But he already knows the scale...
hu: De... ő már... régen túlvan a skálázós szinten.

source: C'mon, we need a change of pace.
hu: Na, gyerünk! Menjünk úszni, hogy jobb kedved legyen!
